# Introduction to Python Day 1
## Workbook Contents <a id = 'cont'></a>
1. [Example - Writing good code](#1)
2. [Example - Basic syntax](#2)
3. [Example - Script structure](#3)
4. [Example - The for loop](#4)
5. [Exercise - My first script](#5)
6. [Example - Built-in functions](#6)
7. [Example - Indexing and slicing](#7)
8. [Example - Iterators](#8)
9. [Example - String maniuplation](#9)
10. [Exercise - Fixing a list of strings](#10)
11. [Exercise - Importing data with pandas](#11)
12. [Example - Importing and exporting data with pandas](#12)
13. [Exercise - User defined functions](#13)
14. [Example - pandas: addressing, indexing, and masks](#14)
15. [Example - pandas: iterating and applying](#15)
16. [Example - pandas: grouping and aggregating](#16)
17. [Example - pandas: concatenating DataFrames](#17)
18. [Exercise - Collecting and analysing separate data sources](#18)
19. [Appendix - Strings and escape chars](#19)

## 1. Example - Writing good code<a id = '1'></a>
[Back to contents](#cont)

<b>Bad example:</b>

Note that this might be ok - if you're just trying to do something quickly and plan on throwing away the code.

In [ ]:
x = 3.141*1.5**2
y = 2*3.14*1.5
z = 2*1.5
x2 = 4*3.14159265*1.5**3/3
print(x,y,z,x2)

<b>Good example:</b>

Takes slightly longer to write - but is re-useable and could be picked up by someone else.<br>
What could be done even better?

In [ ]:
# radius in metres
r = 1.5
# value of pi
PI = 3.14159265

# ** is to the power of
# area of circle according to A = pi*r^2
A = PI*r**2
# circumference of circle according to c = 2*pi*r
c = 2*PI*r
# diameter of circle according to d = 2r
d = 2*r
# volume of sphere according to V = 4*pi*r^3/3
V = 4*PI*r**3/3

print('Area is ',A)
print('Circumference is ',c)
print('Diameter is ',d)
print('Volume is ',V)

## 2. Example - Basic syntax<a id = '2'></a>
[Back to contents](#cont)

<b>Notice the key feautres:</b>
- different types of comment
- string variables vs integers / numeric
- use of keywords (e.g. <code>print</code>) and operators (e.g. <code>=</code>)

N.B. the result of adding strings is different than adding integers.

In [ ]:
# define a string variable
a_string = '1'
# add two strings together and print them
print(a_string + a_string)

In [ ]:
'''define a string variable
add two strings together
and print them'''

an_int = 1
print(an_int + an_int)

## 3. Example - Script Structure <a id = '3'></a>
[Back to contents](#cont)

<b>Read the below and feel free to modify.</b> <br>
N.B. the below has additional comments to explain - normally you wouldn't use this many.

In [ ]:
# -*- coding: utf-8 -*-
"""
Created on Mon Sep  7 16:29:43 2020

@author: jasonboyle
"""
# script header above - not required but often auto-generated, notice triple quotes

# import modules required
import math

# define any user-defined functions here:

# def keyword introduces function
def my_function(): # function arguments are enclosed in brackets (no arguments here)
    '''function to print a pre-defined string'''
    # notice colon above, and notice that the line below the colon is indented
    # this function just prints a pre-defined string
    print('This is a function!')

# define another function that takes an integer argument    
def pow_2(an_int: int):
    # an_int is defined with local scope
    '''function to raise to power 2'''
    # do a simple calculation squaring the integer
    result_int = math.pow(an_int,2) # note that math.pow takes two arguments (base and exponent) separated by ,
    # note that this calculation can be performed as an_int**2 -it's the same
    
    # return the result of the calculation
    return result_int


# call the basic function to print our message
my_function()


# define the value of an integer - play around with this value to see what happens
my_int = 6 

# do a logical test
if my_int >= 5: #>= is greater than or equal to
    function_result = pow_2(my_int)
    print('Function result is: ', function_result) #notice print can take multiple arguments separated by ,
    
else:
    print('Integer is less than 5 - function not called')
    

help(print)
help(pow_2)

The script is repeated here with minimal comments - it may be easier to see what's happening

In [ ]:
# -*- coding: utf-8 -*-
"""
Created on Mon Sep  7 16:29:43 2020

@author: jasonboyle
"""

# import required modules
import math

# define functions
def my_function():
    print('This is a function!')

def pow_2(an_int: int):
    result_int = math.pow(an_int,2)
    return result_int

# call function and set int variable
my_function()
my_int = 6 

# do logical test for my_int more than 5 - calling pow_2 if succesful
if my_int >= 5:
    function_result = pow_2(my_int)
    print('Function result is: ', function_result)
    
else:
    print('Integer is less than 5 - function not called')

## 4. Example - the <code>for</code> loop <a id = '4'></a>
[Back to contents](#cont)

Using <code>range()</code>

In [ ]:
for i in range(10):
    print(i, 'Hello world!')

<b>NB</b> - indexing in Python starts from 0. The first element is indexed as 0.

Iterating with a <code>for</code> loop

In [ ]:
a_list = ['Sarah','Aqib','Jane','Tom']

for j in a_list:
    print(j)

With <code>enumerate</code>

In [ ]:
for i, name in enumerate(a_list):
    print(i, name)

Unpacking the <code>tuple</code>

In [ ]:
for a_tuple in enumerate(a_list):
    i, name = a_tuple # using two variables for a two value tuple automatically unpacks
    print(i,name)

Unpacking the <code>tuple</code>

In [ ]:
for a_tuple in enumerate(a_list):
    print((*a_tuple)) # manually unpack

## 5. Exercise - My First Script <a id ='5'></a>
[Back to contents](#cont)


<b>Write a script which does the following:</b>
- Stores 2 variables (one numeric, one string)
- Tests two logical conditions on the numeric variable
- Prints the string if logical conditions are met

Remember to use <code>if condition is true:</code>… and that <code>:</code> should be followed by an indent on the next line

In [ ]:
# Enter your script here

<b>Answer:</b>

In [ ]:
my_string = 'Success!'
my_int = 8
my_float = 2.75

# test if integer is a factor of 2 and float is greater than or equal to 2.5
if my_int%2 == 0 and my_float >=2.5:
    print(my_string)

else:
    print("Criteria not met")

<b>Alternative Answer:</b>

In [ ]:
my_string = 'Success!'
my_int = 8
my_float = 2.75

# test if integer is a factor of 2
if my_int%2 == 0:
     # test if float is greater than or equal to 2.5
    if my_float >=2.5:
        print(my_string)
else:
    print("Criteria not met")

The second method uses nested <code>if</code> <code>else</code> blocks - this can be useful if you have more complicated logic flow and need to do something different at each logical step.

In this case - we don't care if one of the conditions is met - only if both are. So the first answer is better as it's more succinct and readable.

## 6. Example - key built-in functions<a id= '6'></a>
[Back to contents](#cont)

<code>print()</code>  - print to screen either a direct value or the value of a variable

In [ ]:
print('Hello World!')
my_var = 'a_long_string'
print(my_var)

String formatting with <code>%</code> - this acts like a placeholder with optional format strings

In [ ]:
an_int = 100
a_float = 445.68868

print('Here is an integer %i' %an_int)
print('Here is a float %f' %a_float)
print('Here are two presentations of the same float %4.3f   %3.0f' %(a_float,a_float))

<code>max()</code> <code>min()</code>  - max / min of multiple values

In [ ]:
max([0,3,5,2])

In [ ]:
min([0,3,5,2])

In [ ]:
min(['aa','b'])

<code>len()</code> - length of an object

In [ ]:
len(['this','is','a','list','of','strings'])

In [ ]:
len('arbitrary_string')

<code>str()</code> <code>int()</code> <code>float()</code> etc.  - convert data types

In [ ]:
str(1)

In [ ]:
int('1')

In [ ]:
float(1)

## 7. Example - Indexing and slicing<a id = '7'></a>
[Back to contents](#cont)

Create a <code>list</code>

In [54]:
a = ['zero','one','two','three','four','five','six','seven','eight','nine','ten']

Zero-based indexing

In [28]:
a[3]

'zero'

Negative indices are an offset from the end of the sequence.

In [30]:
a[-3]

'eight'

This is known as a slice. Note that the lower limit is inclusive, while the upper limit it exclusive.

In [31]:
a[3:6]

['three', 'four', 'five']

Yes, it's empty: you reached the end before you started!

In [38]:
a[6:-3]

['six', 'seven']

Leaving out a limit means "go as far as you can in that direction".

In [39]:
a

['zero',
 'one',
 'two',
 'three',
 'four',
 'five',
 'six',
 'seven',
 'eight',
 'nine',
 'ten']

In [42]:
a[:6]

['zero', 'one', 'two', 'three', 'four', 'five']

A third number gives the step size. It can be negative.

In [56]:
a[::-1]

['ten',
 'nine',
 'eight',
 'seven',
 'six',
 'five',
 'four',
 'three',
 'two',
 'one',
 'zero']

In [65]:
a[0:6:2]

['zero', 'two', 'four']

## 8. Example - Iterators<a id = '8'></a>
[Back to contents](#cont)

Using the list from before:

In [83]:
a = ['zero','one','two','three','four','five','six','seven','eight','nine','ten']
a

['zero',
 'one',
 'two',
 'three',
 'four',
 'five',
 'six',
 'seven',
 'eight',
 'nine',
 'ten']

Using a manually constructed <code>for</code> loop - we've got the start and end points wrong so have missed 'zero' and got an error as we tried to access an element that doesn't exist.

In [69]:
for i in range(1,12):
    print(a[i])

one
two
three
four
five
six
seven
eight
nine
ten

IndexError: list index out of range

Let's add a new value to the list

In [70]:
a.append('eleven')
a

['zero',
 'one',
 'two',
 'three',
 'four',
 'five',
 'six',
 'seven',
 'eight',
 'nine',
 'ten',
 'eleven']

Using <code>for</code>

In [71]:
for i in a:
    print(i)

zero
one
two
three
four
five
six
seven
eight
nine
ten
eleven

Using <code>enumerate</code>

In [72]:
for i, val in enumerate(a):
    print(i, val)

0 zero
1 one
2 two
3 three
4 four
5 five
6 six
7 seven
8 eight
9 nine
10 ten
11 eleven

With a slice to print the final 3 values from high to low

In [75]:
a = a[-1:-4:-1]

for i, val in enumerate(a):
    print(i, val)

0 nine
1 ten
2 eleven

## 9. Example - string manipulation<a id = '9'></a>
[Back to contents](#cont)

Define a string (datatype <code>str</code>)

In [86]:
my_string = 'WBS-1533271'

Slicing works with strings too! As strings are just arrays of characters

In [77]:
my_string[4:8]

'1533'

Stack a slice to perform two concurrent slices

In [84]:
my_string = my_string[:6][-2:]

['two', 'one', 'zero']

Flip the string (<code>::</code> indicates the whole string, <code>-1</code> indicates in reverse)

In [87]:
my_string[::-1]

'1723351-SBW'

Split the string based on a particular character using <code>.split()</code> - returns a <code>list</code>

In [91]:
my_string.split('-')

for i in my_string.split('-'):
    print(i)

WBS
1533271

Count occurences of a particular character using <code>.count()</code>

In [93]:
my_string.count('3')

1

More powerful string searching with <code>regex</code>:

In [99]:
import re

string1 = 'The rain in Spain'
string2 = 'The dog in Spain'
string3 = 'The cat in spain'

re.search('^The.*Spain$', string1)

'the cat in spain'

In [95]:
re.search('^The.*Spain$', string2)

In [100]:
re.search('^The.*Spain$', string3)

## 10. Exercise - Fixing a list of strings<a id = '10'></a>
[Back to contents](#cont)

Starting with a <code>list</code> of strings below these have the following characteristics:
- Each string has a person's 'spirit animal' and their full name
- Animals are separated by '_' from the name
- Names are in order first then last, separated by a space
- Animals have accidentally been entered in reverse order
- There are some blank entries which we're not interested in
Example: John Smith's spirit animal is a dog - the string would be 'god_John Smith'

<b>Requirement</b>
1. Split the strings into three separate lists first name, last name, spirit animal
2. The animal list should contain animals the right way round
3. Some strings in the list are blank - get rid of these, they shouldn't show up in the final lists
4. BONUS - get a list of animals which are 'subspecies' these have commas in the animal name: e.g. 'dog, labrador'
5. BONUS - create a new list of strings which recombines and expands on the separate lists in a useful way: e.g. 'John Smith's spirit animal is a dog'
6. BONUS - count the number of subspecies

<b>HINT</b>

- Think about how you can fix one string on its own, then how can you extend this to a list, creating multiple results lists.
- You will need to combine what we have learned about strings, iterators, indexing, and lists

In [102]:
string_list = ['retaw ,naageL_Cacilie Lenahan', '', 'ylzzirg ,raeB_Crichton Comelini',
'dekcen-ylloow ,krotS_Cosetta Micallef', 'nainosduh ,tiwdoG_Dolly Dyer',
'esuorg egas retaerG_Meaghan Abbett', 'enipucrop naciremA htroN_Banky Lukash',
'alaoK_Gian Yarranton', 'retto revir naciremA htroN_Ariel Brett', '',
'elgae ynwaT_Matthus Sellner', 'ooragnak decaf-kcalB_Ethel De Bernardi',
'eulb ,kcocaeP_Paulie Reddecliffe', 'esiotrot treseD_Bastien Unwin', '',
'gohegdeh nacirfA htuoS_Ambrosio Heamus', '', '', 'nrehtuos ,gniwpaL_Jobey Rosini',
'yraccep deppil-etihW_Libbi Jeske', 'yballaw eligA_Arabela MacManus',
'ekans recaR_Wilfrid Brownrigg', 'kcalb ,nawS_Delinda Broschke',
'dedaeh-wolley ,aracaraC_Robbie Kittman', 'llibnepo ,krotS_Gaspar Butchers']

# Write your solution here

<b>Answer:</b>

In [103]:
# use prettyprinter to make results output more nicely
from pprint import pprint

# define empty lists 
first_name_list = []
last_name_list = []
animal_list = []
subspecies_list = []

for item in string_list:
    # only interested in non empty items
    if len(item) != 0:
        
        # split the string by underscore
        item_splits = item.split('_')
        
        # name is first element of the split up list
        name = item_splits[1]
        
        # split the name up by space
        name_splits = name.split(' ')
        # first name is first part of split list
        first_name = name_splits[0]
        # last name is second element
        last_name = name_splits[1]
        
        # the reversed animal was the first part of the split up list
        reversed_animal = item_splits[0]
        # reverse the string        
        animal = reversed_animal[::-1]
        
        # append values to respective lists
        first_name_list.append(first_name)
        last_name_list.append(last_name)
        animal_list.append(animal)
        
        # test if the animal string contains a comma
        if ',' in animal:
            subspecies_list.append(animal)

# print results            
print('\nFirst names:')            
pprint(first_name_list)
print('\nLast names:')
pprint(last_name_list)
print('\nSpirit Animals:')
pprint(animal_list)
print('\nSubspecies:')
pprint(subspecies_list)
print('\nNumber of subspecies: ', len(subspecies_list))

First names:
['Cacilie',
 'Crichton',
 'Cosetta',
 'Dolly',
 'Meaghan',
 'Banky',
 'Gian',
 'Ariel',
 'Matthus',
 'Ethel',
 'Paulie',
 'Bastien',
 'Ambrosio',
 'Jobey',
 'Libbi',
 'Arabela',
 'Wilfrid',
 'Delinda',
 'Robbie',
 'Gaspar']

Last names:
['Lenahan',
 'Comelini',
 'Micallef',
 'Dyer',
 'Abbett',
 'Lukash',
 'Yarranton',
 'Brett',
 'Sellner',
 'De',
 'Reddecliffe',
 'Unwin',
 'Heamus',
 'Rosini',
 'Jeske',
 'MacManus',
 'Brownrigg',
 'Broschke',
 'Kittman',
 'Butchers']

Spirit Animals:
['Legaan, water',
 'Bear, grizzly',
 'Stork, woolly-necked',
 'Godwit, hudsonian',
 'Greater sage grouse',
 'North American porcupine',
 'Koala',
 'North American river otter',
 'Tawny eagle',
 'Black-faced kangaroo',
 'Peacock, blue',
 'Desert tortoise',
 'South African hedgehog',
 'Lapwing, southern',
 'White-lipped peccary',
 'Agile wallaby',
 'Racer snake',
 'Swan, black',
 'Caracara, yellow-headed',
 'Stork, openbill']

Subspecies:
['Legaan, water',
 'Bear, grizzly',
 'Stork, woolly-necked',
 'Godwit, hudsonian',
 'Peacock, blue',
 'Lapwing, southern',
 'Swan, black',
 'Caracara, yellow-headed',
 'Stork, openbill']

Number of subspecies:  9

In [112]:
name_splits[1]

'Butchers'

## 11. Exercise - importing data with pandas<a id = '11'></a> 
[Back to contents](#cont)

<b>Requirement</b>
1. Read in <code>.csv</code> data from the following location <code>C:\Users\student\Desktop\Python Training\MOCK_DATA.csv</code>

<b>Key pandas functions for import and export:</b>
- <code>pd.read_csv(a_path)</code>
- <code>pd.read_excel(a_path)</code>
- <code>pd.to_csv(a_path)</code>
- <code>pd.to_excel(a_path)</code>

In [ ]:
import pandas as pd
# your code goes here

<b>Answer</b>

In [113]:
import pandas as pd

# define file path
data_path = r'C:\Users\jasonboyle\desktop\Python Training\MOCK_DATA.csv'

# read in - data is now stored in a dataframe in python
my_df = pd.read_csv(data_path)

my_df

,id,first_name,last_name,email,gender,ip_address,salary,date_of_birth
0,1,Graham,Ivanenkov,givanenkov0@uiuc.edu,Male,12.58.104.199,102778,11/06/1969
1,2,Karlis,Ballchin,kballchin1@alibaba.com,Male,128.63.193.159,70340,10/04/1969
2,3,Moria,Barber,mbarber2@oaic.gov.au,Female,175.165.231.76,28931,05/03/1950
3,4,Leighton,Quinnette,lquinnette3@biblegateway.com,Male,21.218.156.217,20684,11/03/1985
4,5,Trenton,Farmiloe,tfarmiloe4@webmd.com,Male,223.133.70.216,106946,09/12/1951
...,...,...,...,...,...,...,...,...
995,996,Innis,Lindell,ilindellrn@privacy.gov.au,Male,33.228.210.6,26023,06/02/1970
996,997,Edin,Gajewski,egajewskiro@privacy.gov.au,Female,7.180.8.157,18719,26/09/1971
997,998,Seymour,Boobier,sboobierrp@noaa.gov,Male,105.196.207.20,22734,28/07/1999
998,999,Gerick,Seyers,gseyersrq@unc.edu,Male,220.22.200.1,85659,10/11/1950
999,1000,Dulcine,Hearl,dhearlrr@tripadvisor.com,Female,21.39.192.200,85235,09/03/2000

## 12. Example - importing and exporting data with pandas<a id = '12'></a> 
[Back to contents](#cont)

Continuing from the example DataFrame above - let's check the columns

In [133]:
my_df = pd.read_csv(data_path)
my_df.columns.values.tolist()
my_df

,id,first_name,last_name,email,gender,ip_address,salary,date_of_birth
0,1,Graham,Ivanenkov,givanenkov0@uiuc.edu,Male,12.58.104.199,102778,11/06/1969
1,2,Karlis,Ballchin,kballchin1@alibaba.com,Male,128.63.193.159,70340,10/04/1969
2,3,Moria,Barber,mbarber2@oaic.gov.au,Female,175.165.231.76,28931,05/03/1950
3,4,Leighton,Quinnette,lquinnette3@biblegateway.com,Male,21.218.156.217,20684,11/03/1985
4,5,Trenton,Farmiloe,tfarmiloe4@webmd.com,Male,223.133.70.216,106946,09/12/1951
...,...,...,...,...,...,...,...,...
995,996,Innis,Lindell,ilindellrn@privacy.gov.au,Male,33.228.210.6,26023,06/02/1970
996,997,Edin,Gajewski,egajewskiro@privacy.gov.au,Female,7.180.8.157,18719,26/09/1971
997,998,Seymour,Boobier,sboobierrp@noaa.gov,Male,105.196.207.20,22734,28/07/1999
998,999,Gerick,Seyers,gseyersrq@unc.edu,Male,220.22.200.1,85659,10/11/1950
999,1000,Dulcine,Hearl,dhearlrr@tripadvisor.com,Female,21.39.192.200,85235,09/03/2000


Let's do some data manipulation

Create a new column for full name

In [137]:
my_df['full_name'] = my_df['first_name'] + ' ' + my_df['last_name']
my_df

,id,first_name,last_name,email,gender,ip_address,salary,date_of_birth,full_name
0,1,Graham,Ivanenkov,givanenkov0@uiuc.edu,Male,12.58.104.199,102778,11/06/1969,Graham Ivanenkov
1,2,Karlis,Ballchin,kballchin1@alibaba.com,Male,128.63.193.159,70340,10/04/1969,Karlis Ballchin
2,3,Moria,Barber,mbarber2@oaic.gov.au,Female,175.165.231.76,28931,05/03/1950,Moria Barber
3,4,Leighton,Quinnette,lquinnette3@biblegateway.com,Male,21.218.156.217,20684,11/03/1985,Leighton Quinnette
4,5,Trenton,Farmiloe,tfarmiloe4@webmd.com,Male,223.133.70.216,106946,09/12/1951,Trenton Farmiloe
...,...,...,...,...,...,...,...,...,...
995,996,Innis,Lindell,ilindellrn@privacy.gov.au,Male,33.228.210.6,26023,06/02/1970,Innis Lindell
996,997,Edin,Gajewski,egajewskiro@privacy.gov.au,Female,7.180.8.157,18719,26/09/1971,Edin Gajewski
997,998,Seymour,Boobier,sboobierrp@noaa.gov,Male,105.196.207.20,22734,28/07/1999,Seymour Boobier
998,999,Gerick,Seyers,gseyersrq@unc.edu,Male,220.22.200.1,85659,10/11/1950,Gerick Seyers
999,1000,Dulcine,Hearl,dhearlrr@tripadvisor.com,Female,21.39.192.200,85235,09/03/2000,Dulcine Hearl

Get rid of the ip adress column using <code>drop</code> as it's surplus

In [149]:
my_df = my_df.drop('ip_address', axis = 1)
my_df

,id,email,gender,salary,date_of_birth,full_name
554,555,aaucottfe@ft.com,Female,14325,29/01/1962,Abbe Aucott
477,478,asouthwoodd9@businessinsider.com,Female,27059,24/05/1983,Abbi Southwood
214,215,asaenz5y@webnode.com,Male,44571,07/01/1974,Abie Saenz
752,753,agregoracekw@gnu.org,Male,28902,07/06/1987,Addie Gregorace
79,80,agaskell27@freewebs.com,Female,57393,11/10/1962,Adeline Gaskell
...,...,...,...,...,...,...
584,585,zdebruyneg8@linkedin.com,Male,45348,19/10/1999,Zachariah De Bruyne
620,621,zfurnivalh8@acquirethisname.com,Male,65818,16/09/1980,Zak Furnival
476,477,zmanchesterd8@gov.uk,Male,11353,26/07/1975,Zak Manchester
234,235,zrussan6i@hhs.gov,Male,73397,05/04/1975,Zelig Russan
825,826,zwoodermx@weibo.com,Male,29217,24/02/1989,Zelig Wooder

Lets order the records alphabetically using <code>sort_values</code>

In [143]:
my_df = my_df.sort_values('full_name', axis = 0, ascending = True)
my_df

,id,first_name,last_name,email,gender,ip_address,salary,date_of_birth,full_name
554,555,Abbe,Aucott,aaucottfe@ft.com,Female,194.53.202.95,14325,29/01/1962,Abbe Aucott
477,478,Abbi,Southwood,asouthwoodd9@businessinsider.com,Female,230.5.87.85,27059,24/05/1983,Abbi Southwood
214,215,Abie,Saenz,asaenz5y@webnode.com,Male,13.26.96.94,44571,07/01/1974,Abie Saenz
752,753,Addie,Gregorace,agregoracekw@gnu.org,Male,101.1.137.105,28902,07/06/1987,Addie Gregorace
79,80,Adeline,Gaskell,agaskell27@freewebs.com,Female,207.144.34.236,57393,11/10/1962,Adeline Gaskell
...,...,...,...,...,...,...,...,...,...
584,585,Zachariah,De Bruyne,zdebruyneg8@linkedin.com,Male,161.218.208.185,45348,19/10/1999,Zachariah De Bruyne
620,621,Zak,Furnival,zfurnivalh8@acquirethisname.com,Male,17.96.192.77,65818,16/09/1980,Zak Furnival
476,477,Zak,Manchester,zmanchesterd8@gov.uk,Male,156.133.99.110,11353,26/07/1975,Zak Manchester
234,235,Zelig,Russan,zrussan6i@hhs.gov,Male,82.173.194.38,73397,05/04/1975,Zelig Russan
825,826,Zelig,Wooder,zwoodermx@weibo.com,Male,222.60.135.180,29217,24/02/1989,Zelig Wooder

Also get rid of the old name columns as we no longer need these - this time we pas a <code>list</code> of multiple columns to <code>drop</code>

In [146]:
my_df = my_df.drop(['first_name','last_name'],axis = 1)
my_df

,id,email,gender,ip_address,salary,date_of_birth,full_name
554,555,aaucottfe@ft.com,Female,194.53.202.95,14325,29/01/1962,Abbe Aucott
477,478,asouthwoodd9@businessinsider.com,Female,230.5.87.85,27059,24/05/1983,Abbi Southwood
214,215,asaenz5y@webnode.com,Male,13.26.96.94,44571,07/01/1974,Abie Saenz
752,753,agregoracekw@gnu.org,Male,101.1.137.105,28902,07/06/1987,Addie Gregorace
79,80,agaskell27@freewebs.com,Female,207.144.34.236,57393,11/10/1962,Adeline Gaskell
...,...,...,...,...,...,...,...
584,585,zdebruyneg8@linkedin.com,Male,161.218.208.185,45348,19/10/1999,Zachariah De Bruyne
620,621,zfurnivalh8@acquirethisname.com,Male,17.96.192.77,65818,16/09/1980,Zak Furnival
476,477,zmanchesterd8@gov.uk,Male,156.133.99.110,11353,26/07/1975,Zak Manchester
234,235,zrussan6i@hhs.gov,Male,82.173.194.38,73397,05/04/1975,Zelig Russan
825,826,zwoodermx@weibo.com,Male,222.60.135.180,29217,24/02/1989,Zelig Wooder

Get the columns using the <code>columns</code> accessor

In [151]:
old_columns = my_df.columns
old_columns

Index(['id', 'email', 'gender', 'salary', 'date_of_birth', 'full_name'], dtype='object')

This produces a <code>pandas</code> <code>index</code> which can be tricky to work with - let's convert to a <code>list</code> instead

In [152]:
old_columns = list(old_columns.values)
old_columns

['id', 'email', 'gender', 'salary', 'date_of_birth', 'full_name']

Now mess around with our <code>list</code> using slices to reorder it note <code>old_columns[-1]</code> is a string - so wrapping it in <code>[]</code> converts it into a list so we can add the two lists together using <code>+</code>

In [157]:
new_columns = [old_columns[-1]] + old_columns[:-1]
new_columns

['full_name', 'id', 'email', 'gender', 'salary', 'date_of_birth']

Now reorder the <code>DataFrame</code> columns

In [158]:
my_df = my_df[new_columns]
my_df

,full_name,id,email,gender,salary,date_of_birth
554,Abbe Aucott,555,aaucottfe@ft.com,Female,14325,29/01/1962
477,Abbi Southwood,478,asouthwoodd9@businessinsider.com,Female,27059,24/05/1983
214,Abie Saenz,215,asaenz5y@webnode.com,Male,44571,07/01/1974
752,Addie Gregorace,753,agregoracekw@gnu.org,Male,28902,07/06/1987
79,Adeline Gaskell,80,agaskell27@freewebs.com,Female,57393,11/10/1962
...,...,...,...,...,...,...
584,Zachariah De Bruyne,585,zdebruyneg8@linkedin.com,Male,45348,19/10/1999
620,Zak Furnival,621,zfurnivalh8@acquirethisname.com,Male,65818,16/09/1980
476,Zak Manchester,477,zmanchesterd8@gov.uk,Male,11353,26/07/1975
234,Zelig Russan,235,zrussan6i@hhs.gov,Male,73397,05/04/1975
825,Zelig Wooder,826,zwoodermx@weibo.com,Male,29217,24/02/1989

If we'd used <code>my_df.columns = new_cols</code> we would have just renamed the existing columns without moving them - not what we wanted!

In [160]:
#e.g. put back to the way it was
test_df = my_df[old_columns]
# now rename
test_df.columns = new_columns
test_df

,full_name,id,email,gender,salary,date_of_birth
554,Abbe Aucott,555,aaucottfe@ft.com,Female,14325,29/01/1962
477,Abbi Southwood,478,asouthwoodd9@businessinsider.com,Female,27059,24/05/1983
214,Abie Saenz,215,asaenz5y@webnode.com,Male,44571,07/01/1974
752,Addie Gregorace,753,agregoracekw@gnu.org,Male,28902,07/06/1987
79,Adeline Gaskell,80,agaskell27@freewebs.com,Female,57393,11/10/1962
...,...,...,...,...,...,...
584,Zachariah De Bruyne,585,zdebruyneg8@linkedin.com,Male,45348,19/10/1999
620,Zak Furnival,621,zfurnivalh8@acquirethisname.com,Male,65818,16/09/1980
476,Zak Manchester,477,zmanchesterd8@gov.uk,Male,11353,26/07/1975
234,Zelig Russan,235,zrussan6i@hhs.gov,Male,73397,05/04/1975
825,Zelig Wooder,826,zwoodermx@weibo.com,Male,29217,24/02/1989

Let's filter the data for people with google email addresses only

In [170]:
# get the subset of data with google email addresses (boolean mask)
my_mask = my_df['email'].str.contains('google')
my_mask
my_df[my_mask]

pandas.core.series.Series

We can do all of the above manipulation in a few lines if we know what we're doing...

In [173]:
my_df = pd.read_csv(data_path)
my_df['full_name'] = my_df['first_name'] + ' ' + my_df['last_name']
my_df = my_df.drop(['ip_address','first_name','last_name'], axis = 1)
cols = list(my_df.columns.values)
google_df = my_df[my_df[[cols[-1]]+cols[:-1]]['email'].str.contains('google')].sort_values(by='full_name', ascending = True)
google_df

,id,email,gender,salary,date_of_birth,full_name
534,535,amacconnaleu@google.com.hk,Female,94610,18/09/1950,Adrienne MacConnal
695,696,ablackhurstjb@google.com.au,Female,14482,06/10/1982,Alta Blackhurst
757,758,bbunnerl1@google.de,Male,58939,30/01/1993,Ber Bunner
888,889,cscrowsonoo@google.it,Female,107027,03/05/1998,Cam Scrowson
912,913,caggepc@google.com.hk,Female,76660,10/05/1964,Cassandry Agge
852,853,cantonomoliino@google.com.br,Female,72382,20/10/1995,Constanta Antonomolii
561,562,dputlandfl@google.es,Male,38509,28/02/1954,Douglass Putland
382,383,edowbakinam@google.ca,Female,57259,29/06/1989,Elaine Dowbakin
446,447,ebrazenerce@google.ca,Male,53693,17/04/1947,Eugenio Brazener
64,65,gslinger1s@google.com.hk,Female,59909,27/08/1953,Gabriell Slinger
619,620,ggorryh7@google.com.br,Male,29531,09/11/1977,Gianni Gorry
137,138,iantonietti3t@google.it,Female,16752,21/10/1949,Ina Antonietti
972,973,jtewkesburyr0@google.com.br,Male,100995,26/06/1956,Jimmie Tewkesbury
14,15,kbrehaulte@google.com,Female,106373,28/03/1958,Karlyn Brehault
257,258,kogle75@google.com.hk,Female,96742,10/04/1955,Kellen Ogle
217,218,lbyfield61@google.com,Female,65434,02/08/1971,Lexy Byfield
294,295,lleese86@google.cn,Female,38857,16/04/1966,Loren Leese
782,783,mbuckwelllq@google.com,Female,97938,09/05/2001,Madelon Buckwell
844,845,malenichevng@google.com.hk,Male,49635,07/07/2001,Mar Alenichev
329,330,mtedorenko95@google.pl,Female,60477,13/05/1959,Maurine Tedorenko

Finally let's put the data in a new excel file

First let's decide on a new file name and path

In [171]:
import os
# combine path with new filename
new_path = os.path.join(os.path.dirname(data_path),'MOCK_DATA_modified.xls')
new_path

'C:\\Users\\jasonboyle\\desktop\\Python Training\\MOCK_DATA_modified.xls'

Or more generically for an arbitrary filename and path we could just append <code>_modified.xls</code> to whatever the source data file was called

In [176]:
head, tail = os.path.split(data_path)
new_path = os.path.join(head, os.path.splitext(tail)[0] + '_modified.xls')  
new_path

'C:\\Users\\jasonboyle\\desktop\\Python Training\\MOCK_DATA_modified.xls'

Output to an Excel file

In [174]:
google_df.to_excel(new_path, index = False)
print('Modified file outputted to %s' %new_path)

Modified file outputted to C:\Users\jasonboyle\desktop\Python Training\MOCK_DATA_modified.xls

Load it back just to check

In [177]:
pd.read_excel(new_path)

,id,email,gender,salary,date_of_birth,full_name
0,535,amacconnaleu@google.com.hk,Female,94610,18/09/1950,Adrienne MacConnal
1,696,ablackhurstjb@google.com.au,Female,14482,06/10/1982,Alta Blackhurst
2,758,bbunnerl1@google.de,Male,58939,30/01/1993,Ber Bunner
3,889,cscrowsonoo@google.it,Female,107027,03/05/1998,Cam Scrowson
4,913,caggepc@google.com.hk,Female,76660,10/05/1964,Cassandry Agge
5,853,cantonomoliino@google.com.br,Female,72382,20/10/1995,Constanta Antonomolii
6,562,dputlandfl@google.es,Male,38509,28/02/1954,Douglass Putland
7,383,edowbakinam@google.ca,Female,57259,29/06/1989,Elaine Dowbakin
8,447,ebrazenerce@google.ca,Male,53693,17/04/1947,Eugenio Brazener
9,65,gslinger1s@google.com.hk,Female,59909,27/08/1953,Gabriell Slinger
10,620,ggorryh7@google.com.br,Male,29531,09/11/1977,Gianni Gorry
11,138,iantonietti3t@google.it,Female,16752,21/10/1949,Ina Antonietti
12,973,jtewkesburyr0@google.com.br,Male,100995,26/06/1956,Jimmie Tewkesbury
13,15,kbrehaulte@google.com,Female,106373,28/03/1958,Karlyn Brehault
14,258,kogle75@google.com.hk,Female,96742,10/04/1955,Kellen Ogle
15,218,lbyfield61@google.com,Female,65434,02/08/1971,Lexy Byfield
16,295,lleese86@google.cn,Female,38857,16/04/1966,Loren Leese
17,783,mbuckwelllq@google.com,Female,97938,09/05/2001,Madelon Buckwell
18,845,malenichevng@google.com.hk,Male,49635,07/07/2001,Mar Alenichev
19,330,mtedorenko95@google.pl,Female,60477,13/05/1959,Maurine Tedorenko

## 13. Exercise - user defined function <a id = '13'></a>
[Back to contents](#cont)

Recall the code for calculating circle and sphere geometry from a radius:<br>
<code>PI = 3.14159265
d = 2\*r
c = 2\*PI\*r
A = PI\*r\*\*2
V = 4\*PI\*r\*\*3/3</code>

<b>Requirement</b>
1. Create a user defined function which returns <code>d</code>,<code>c</code>,<code>A</code>,<code>V</code> as a <code>tuple</code>.
2. BONUS take user input for the radius by using <code>r = input()</code>

You can use the <code>math</code> module to import PI as a constant rather than hard-coding it

HINT: your code should include <code>def</code>...

In [ ]:
#type your code in here using the starting points below

from math import pi

#define function here
    # calculations here
#    return # return values here

# call the function here

<b>Answer</b>

In [ ]:
# clear variables for user input
%clear
# import pi constant
from math import pi

# define function
def radius_geometry(r: float): #optional : float restricts the value the function can accept
    '''takes a radius r and returns various circle / sphere geometry measures''' #docstring
    # calculations
    d = 2*r
    c = 2*pi*r
    A = pi*r**2
    V = 4*pi*r**3/3
    # return values
    return d,c,A,V

# loop for input to repeat until valid input received
success_flag = False
while success_flag != True:
    r = input()
    try:
        r = float(r)
        success_flag = True
    except:
        pass
        print('Not a number - try again!')

#invoke function
radius_geometry(r)

## 14. Example - pandas: addressing, indexing, and masks<a id = '14'></a>
[Back to contents](#cont)

Let's create a DataFrame from scratch using lists

In [12]:
import pandas as pd

animal_list = ['dog','cat','rabbit','mouse','guinea pig','goldfish']
count_list = [7,5,3,1,1,5]

pd.DataFrame(list(zip(animal_list,count_list)), columns = ['animals', 'counts'])

      animals  counts
0         dog       7
1         cat       5
2      rabbit       3
3       mouse       1
4  guinea pig       1
5    goldfish       5

Equivalently using a dictionary rather than lists

In [13]:
data_dict = {'animals' : ['dog','cat','rabbit','mouse','guinea pig','goldfish'], 'counts' :[7,5,3,1,1,5]}
df = pd.DataFrame(data_dict)
df

      animals  counts
0         dog       7
1         cat       5
2      rabbit       3
3       mouse       1
4  guinea pig       1
5    goldfish       5

Note that the pandas index may not be numeric, and could be made of strings for example.

Using list comprehension (a compact <code>for</code> loop) we can create a new index list

In [14]:
new_index = ['row %i' %i for i in range(len(df))]
new_index

['row 0', 'row 1', 'row 2', 'row 3', 'row 4', 'row 5']

Let's change the index

In [15]:
df.index = new_index
df

          animals  counts
row 0         dog       7
row 1         cat       5
row 2      rabbit       3
row 3       mouse       1
row 4  guinea pig       1
row 5    goldfish       5

Addressing columns as attributes produces a pandas series

In [16]:
df.animals

row 0           dog
row 1           cat
row 2        rabbit
row 3         mouse
row 4    guinea pig
row 5      goldfish
Name: animals, dtype: object

Similarly using string column names to address columns

In [17]:
df['animals']

row 0           dog
row 1           cat
row 2        rabbit
row 3         mouse
row 4    guinea pig
row 5      goldfish
Name: animals, dtype: object

Reommended approach for pandas index and column indexing is <code>.loc[index,column]</code>

In [21]:
df.loc[:,'animals']

'dog'

Also recommended using integer indexing <code>.iloc[row number, column number]</code>

In [23]:
df.iloc[3:0]

'mouse'

For specific rows and columns - we can slice as per ususal

In [24]:
df.iloc[0:3, 0]

row 0       dog
row 1       cat
row 2    rabbit
Name: animals, dtype: object

In [25]:
df.loc['row 2', 'animals']

'rabbit'

We can use logical tests to develop a 'Boolean mask' of a DataFrame

In [26]:
bool_mask = df['counts']>2
bool_mask

row 0     True
row 1     True
row 2     True
row 3    False
row 4    False
row 5     True
Name: counts, dtype: bool

We can then apply the mask to the DataFrame giving a reduced portion of the DataFrame which meets the logical criteria

In [27]:
df[bool_mask]

        animals  counts
row 0       dog       7
row 1       cat       5
row 2    rabbit       3
row 5  goldfish       5

## 15. Example - pandas: iterating and applying<a id='15'></a>
[Back to contents](#cont)

Let's use the data from earlier to test some more techniques

In [28]:
import pandas as pd

# define file path
data_path = r'C:\Users\jasonboyle\Desktop\Python Training\MOCK_DATA.csv'

# read in - data is now stored in a dataframe in python
my_df = pd.read_csv(data_path)

my_df

,id,first_name,last_name,email,gender,ip_address,salary,date_of_birth
0,1,Graham,Ivanenkov,givanenkov0@uiuc.edu,Male,12.58.104.199,102778,11/06/1969
1,2,Karlis,Ballchin,kballchin1@alibaba.com,Male,128.63.193.159,70340,10/04/1969
2,3,Moria,Barber,mbarber2@oaic.gov.au,Female,175.165.231.76,28931,05/03/1950
3,4,Leighton,Quinnette,lquinnette3@biblegateway.com,Male,21.218.156.217,20684,11/03/1985
4,5,Trenton,Farmiloe,tfarmiloe4@webmd.com,Male,223.133.70.216,106946,09/12/1951
...,...,...,...,...,...,...,...,...
995,996,Innis,Lindell,ilindellrn@privacy.gov.au,Male,33.228.210.6,26023,06/02/1970
996,997,Edin,Gajewski,egajewskiro@privacy.gov.au,Female,7.180.8.157,18719,26/09/1971
997,998,Seymour,Boobier,sboobierrp@noaa.gov,Male,105.196.207.20,22734,28/07/1999
998,999,Gerick,Seyers,gseyersrq@unc.edu,Male,220.22.200.1,85659,10/11/1950
999,1000,Dulcine,Hearl,dhearlrr@tripadvisor.com,Female,21.39.192.200,85235,09/03/2000

Iterate over columns to perform operations on each column (pandas Series)

In [30]:
for column in my_df:
    print(column, min(my_df[column]), max(my_df[column]))

id 1 1000
first_name Abbe Zelig
last_name Abelovitz todor
email aaffroneo@nifty.com zwoodermx@weibo.com
gender Female Male
ip_address 0.1.122.52 99.96.224.186
salary 10009 109983
date_of_birth 01/01/1945 31/12/2001
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             1000 non-null   int64
 1   first_name     1000 non-null   object
 2   last_name      1000 non-null   object
 3   email          1000 non-null   object
 4   gender         1000 non-null   object
 5   ip_address     1000 non-null   object
 6   salary         1000 non-null   int64
 7   date_of_birth  1000 non-null   object
dtypes: int64(2), object(6)
memory usage: 62.6+ KB

This is equivalent to using the <code>iteritems()</code> iterator - which  returns a tuple of columns and values. This is the recommended method for column iteration

In [ ]:
for column, values in my_df.iteritems():
    print(column, min(values), max(values))

The results for min and max date of birth don't look right. These dates have been wrongly imported as strings. Let's fix it

In [33]:
my_df['date_of_birth'] = pd.to_datetime(my_df['date_of_birth'])
my_df

,id,first_name,last_name,email,gender,ip_address,salary,date_of_birth
0,1,Graham,Ivanenkov,givanenkov0@uiuc.edu,Male,12.58.104.199,102778,1969-11-06
1,2,Karlis,Ballchin,kballchin1@alibaba.com,Male,128.63.193.159,70340,1969-10-04
2,3,Moria,Barber,mbarber2@oaic.gov.au,Female,175.165.231.76,28931,1950-05-03
3,4,Leighton,Quinnette,lquinnette3@biblegateway.com,Male,21.218.156.217,20684,1985-11-03
4,5,Trenton,Farmiloe,tfarmiloe4@webmd.com,Male,223.133.70.216,106946,1951-09-12
...,...,...,...,...,...,...,...,...
995,996,Innis,Lindell,ilindellrn@privacy.gov.au,Male,33.228.210.6,26023,1970-06-02
996,997,Edin,Gajewski,egajewskiro@privacy.gov.au,Female,7.180.8.157,18719,1971-09-26
997,998,Seymour,Boobier,sboobierrp@noaa.gov,Male,105.196.207.20,22734,1999-07-28
998,999,Gerick,Seyers,gseyersrq@unc.edu,Male,220.22.200.1,85659,1950-10-11
999,1000,Dulcine,Hearl,dhearlrr@tripadvisor.com,Female,21.39.192.200,85235,2000-09-03

To perform operations on a row-by-row basis - we could iterate, but this is slow and inefficienct in pandas.

E.g. let's calculate age based on current date

In [36]:
from datetime import datetime

datetime.now()

datetime.datetime(2020, 9, 18, 9, 53, 11, 174441)

In [37]:
from datetime import datetime
age_list = []

#iterate over rows
for row in my_df['date_of_birth']:
    datediff_days = (datetime.now() - row).days
    age_list.append((datediff_days/365))

my_df['age'] = age_list
my_df

,id,first_name,last_name,email,gender,ip_address,salary,date_of_birth,age
0,1,Graham,Ivanenkov,givanenkov0@uiuc.edu,Male,12.58.104.199,102778,1969-11-06,50.901370
1,2,Karlis,Ballchin,kballchin1@alibaba.com,Male,128.63.193.159,70340,1969-10-04,50.991781
2,3,Moria,Barber,mbarber2@oaic.gov.au,Female,175.165.231.76,28931,1950-05-03,70.427397
3,4,Leighton,Quinnette,lquinnette3@biblegateway.com,Male,21.218.156.217,20684,1985-11-03,34.898630
4,5,Trenton,Farmiloe,tfarmiloe4@webmd.com,Male,223.133.70.216,106946,1951-09-12,69.065753
...,...,...,...,...,...,...,...,...,...
995,996,Innis,Lindell,ilindellrn@privacy.gov.au,Male,33.228.210.6,26023,1970-06-02,50.331507
996,997,Edin,Gajewski,egajewskiro@privacy.gov.au,Female,7.180.8.157,18719,1971-09-26,49.013699
997,998,Seymour,Boobier,sboobierrp@noaa.gov,Male,105.196.207.20,22734,1999-07-28,21.158904
998,999,Gerick,Seyers,gseyersrq@unc.edu,Male,220.22.200.1,85659,1950-10-11,69.986301
999,1000,Dulcine,Hearl,dhearlrr@tripadvisor.com,Female,21.39.192.200,85235,2000-09-03,20.054795

We can use <code>apply</code> to apply a function to a column without iterating.

Let's use the <code>numpy</code> library which includes a range of vectorized mathemtaical functions.

Specifically we can use <code>np.floor</code> to round down our ages then convert to <code>int</code.

In [38]:
import numpy as np
# round down and convert
my_df['age'] = my_df['age'].apply(np.floor).astype(int)
my_df

,id,first_name,last_name,email,gender,ip_address,salary,date_of_birth,age
0,1,Graham,Ivanenkov,givanenkov0@uiuc.edu,Male,12.58.104.199,102778,1969-11-06,50
1,2,Karlis,Ballchin,kballchin1@alibaba.com,Male,128.63.193.159,70340,1969-10-04,50
2,3,Moria,Barber,mbarber2@oaic.gov.au,Female,175.165.231.76,28931,1950-05-03,70
3,4,Leighton,Quinnette,lquinnette3@biblegateway.com,Male,21.218.156.217,20684,1985-11-03,34
4,5,Trenton,Farmiloe,tfarmiloe4@webmd.com,Male,223.133.70.216,106946,1951-09-12,69
...,...,...,...,...,...,...,...,...,...
995,996,Innis,Lindell,ilindellrn@privacy.gov.au,Male,33.228.210.6,26023,1970-06-02,50
996,997,Edin,Gajewski,egajewskiro@privacy.gov.au,Female,7.180.8.157,18719,1971-09-26,49
997,998,Seymour,Boobier,sboobierrp@noaa.gov,Male,105.196.207.20,22734,1999-07-28,21
998,999,Gerick,Seyers,gseyersrq@unc.edu,Male,220.22.200.1,85659,1950-10-11,69
999,1000,Dulcine,Hearl,dhearlrr@tripadvisor.com,Female,21.39.192.200,85235,2000-09-03,20

We can repeat this whole calculation process more efficiently, using <code>apply</code> with a disposable <code>lambda</code> function

In [40]:
my_df['age'] = my_df.apply(lambda row: int(np.floor((datetime.now() - row['date_of_birth']).days/365)) , axis =1)
my_df

,id,first_name,last_name,email,gender,ip_address,salary,date_of_birth,age
0,1,Graham,Ivanenkov,givanenkov0@uiuc.edu,Male,12.58.104.199,102778,1969-11-06,50
1,2,Karlis,Ballchin,kballchin1@alibaba.com,Male,128.63.193.159,70340,1969-10-04,50
2,3,Moria,Barber,mbarber2@oaic.gov.au,Female,175.165.231.76,28931,1950-05-03,70
3,4,Leighton,Quinnette,lquinnette3@biblegateway.com,Male,21.218.156.217,20684,1985-11-03,34
4,5,Trenton,Farmiloe,tfarmiloe4@webmd.com,Male,223.133.70.216,106946,1951-09-12,69
...,...,...,...,...,...,...,...,...,...
995,996,Innis,Lindell,ilindellrn@privacy.gov.au,Male,33.228.210.6,26023,1970-06-02,50
996,997,Edin,Gajewski,egajewskiro@privacy.gov.au,Female,7.180.8.157,18719,1971-09-26,49
997,998,Seymour,Boobier,sboobierrp@noaa.gov,Male,105.196.207.20,22734,1999-07-28,21
998,999,Gerick,Seyers,gseyersrq@unc.edu,Male,220.22.200.1,85659,1950-10-11,69
999,1000,Dulcine,Hearl,dhearlrr@tripadvisor.com,Female,21.39.192.200,85235,2000-09-03,20

This is better - but the syntax is a little messy, and we haven't accounted for leap-years. We really need to define a custom function for this and <code>apply</code> that instead.

Define and test the function:

In [41]:
def calc_age(dob: datetime):
    # current year - birth year
    current = datetime.now()
    year_delta = current.year - dob.year
    month_delta = current.month - dob.month
    day_delta = current.day - dob.day
    
    if current.month > dob.month or (current.month == dob.month and current.day >= dob.day):
        age = year_delta
    else:
        age = year_delta - 1
    return (age)
    
    
print(my_df.loc[0,'date_of_birth'])
print(calc_age(my_df.loc[0,'date_of_birth']))

1969-11-06 00:00:00
50

Now let's <code>apply</code> the <code>calc_age</code> function to the <code>'date of birth'</code> <code>series</code>:

In [42]:
my_df['age'] = my_df['date_of_birth'].apply(calc_age)
my_df

,id,first_name,last_name,email,gender,ip_address,salary,date_of_birth,age
0,1,Graham,Ivanenkov,givanenkov0@uiuc.edu,Male,12.58.104.199,102778,1969-11-06,50
1,2,Karlis,Ballchin,kballchin1@alibaba.com,Male,128.63.193.159,70340,1969-10-04,50
2,3,Moria,Barber,mbarber2@oaic.gov.au,Female,175.165.231.76,28931,1950-05-03,70
3,4,Leighton,Quinnette,lquinnette3@biblegateway.com,Male,21.218.156.217,20684,1985-11-03,34
4,5,Trenton,Farmiloe,tfarmiloe4@webmd.com,Male,223.133.70.216,106946,1951-09-12,69
...,...,...,...,...,...,...,...,...,...
995,996,Innis,Lindell,ilindellrn@privacy.gov.au,Male,33.228.210.6,26023,1970-06-02,50
996,997,Edin,Gajewski,egajewskiro@privacy.gov.au,Female,7.180.8.157,18719,1971-09-26,48
997,998,Seymour,Boobier,sboobierrp@noaa.gov,Male,105.196.207.20,22734,1999-07-28,21
998,999,Gerick,Seyers,gseyersrq@unc.edu,Male,220.22.200.1,85659,1950-10-11,69
999,1000,Dulcine,Hearl,dhearlrr@tripadvisor.com,Female,21.39.192.200,85235,2000-09-03,20

Success!

## 16. Example - pandas: grouping and aggregating<a id = '16'></a>
[Back to contents](#cont)

Using the <code>.groupby</code> method we can group similar entries together. Grouping by gender:

In [ ]:
my_df.groupby('gender')

Now let's add some custom grouping using a <code>mask</code> and the <code>numpy</code> <code>where</code> function

In [ ]:
mask = my_df['age']<50
mask = np.where(mask==True,'Less than 50', '50 or older')

grouped_df = my_df.groupby(by=['gender',mask])
grouped_df

Now we can aggregate the data by functions of our choosing. Let's check the columns first

In [ ]:
my_df.columns

Now let's aggregate

In [ ]:
# use a dict for ease
agg_dict = {'id': 'count', 'age': 'mean', 'salary': ['min', 'max' ,'std']}
agg_df = grouped_df.agg(agg_dict)
agg_df

This looks good - but has produced <code>mult-index</code> columns. These can be useful but may be hard to work with when outputting data. Let's flatten them to new column names.

In [ ]:
# use list comprehension to get new column names
new_cols = [col+'_'+function for col, function in agg_df.columns.ravel()]

# assign new column names
agg_df.columns = new_cols
agg_df

## 17. Example - pandas: concatenating DataFrames<a id = '17'></a> 
[Back to contents](#cont)

Let's go back to the original data, and split up the <code>DataFrame</code> into 200 row chunks and put each in a new <code>DataFrame</code> stored in a <code>list</code>

In [ ]:
import numpy as np

# create empty list to store dfs:
df_list = []

# use a numpy array to find lower bounds
n = 200
lower_list = np.arange(0,len(my_df),n)

# loop to split into separate dataframes
for low in lower_list:
    split_df = my_df.iloc[low:low+n,:]
    df_list.append(split_df)

Now let's arbitrarily stick the 3rd and 4th <code>DataFrames</code> back to gether - like a <code>UNION</code>

In [ ]:
union_df = pd.concat(df_list[2:4])
union_df

Next lets <code>append</code> a new row to the bottom of this new <code>DataFrame</code>. First create a <code>dict</code> of column-value pairs

In [ ]:
cols = union_df.columns.to_list()
values = (1001,'Joe','Bloggs','joebloggs99@hotmail.com','Male','345.112.543.22',13470,'17/05/1999')

newrow_dict = dict(zip(cols,values))
newrow_dict

Now add to the <code>DataFrame</code>. Note that the new entry has <code>NaN</code> for age - as we calculated this earlier.

In [ ]:
union_df.append(newrow_dict, ignore_index = True)

We can also join the dataframe horizontally using the <code>axis = 1</code> argument - notice that empty <code>NaN</code> values are created because the indexes don't match - this is like a SQL <code>OUTER JOIN</code>.

In [ ]:
pd.concat(df_list[2:4], axis = 1)

If we want to ignore indexes and just stick the columns together arbitrarily <b>don't</b> use the <code>ignore_index</code> keyword as this does something else. Instead we need to <code>reset_index</code> for each individual dataframe we join

In [ ]:
new_index_df_list = [df.reset_index() for df in df_list]

pd.concat(new_index_df_list[2:4], axis = 1)

## 18. Exercise - collecting and analysing separate data sources<a id = '18'></a>
[Back to contents](#cont)

<b>Requirement</b>
1. Read in the 6 datafiles (of unknown location) containing car sales data which sit in the folder <code>C:\Users\student\Python Training\Car Sales</code>


2. Store the region number from the filename


3. Combine the individual files into one <code>DataFrame</code>, the new <code>DataFrame</code> should include which region the file is from


4. Fix any columns which may not be formatted as the right dataype (<b>hint:</b> look at numerics and dates... you may want to look up the <code>Series.str.replace()</code>, <code>pd.to_datetime()</code> and <code>pd.to_numeric()</code> functions)


5. Write down the rrp and monthly_cost by 30% each for any Audi brand car, which has a model year earlier than 2005 (<b>hint</b>: There are multiple ways to achieve this but <code>np.where</code> could be useful here. To combine logical tests you will need to use the bitwise operator <code>&</code> not the scalar operator <code>and</code> 


6. Get rid of any entries which have no data in the numeric fields - these are erroneous


7. Use the provided dictionary <code>region_dict</code> to (<b>hint</b>) <code>map</code> regions to the region number deduced from the filenames


8. Summarize data by region and make - some stats like mean rrp would be useful


9. Output the summary to a new csv or excel file


10. BONUS - find the rarest cars


These requirements are complicated so don't expect to get them all. Facilitators will drop in and out of groups to help as much as possible. We can continue the exercise into Day 2 if we run out of time.

Feel free to use spyder or another IDE rather than Jupyter if you find it easier. Materials can also be found hon remote desktop instead.

Let's build up some pseudo code as a hint:

In [ ]:
# pseudocode for one way of doing it:

# import any modules needed

# loop over all directories and files using os walk - creating lists for each
    # loop over all files in the list
        # read each the individual file into pandas dataframe
        # store the dataframe in a dicitionary with the filename as the key

# iterate over the dictionary key, value pairs
    # take the file name and use string manipulation to split it up and deduce region number
    # create new column in the dataframe for the region number
    # convert number to int from string
    
# combine separate dataframes into one
# remove extra strings around the numeric fields (e.g. £)
# convert the numeric fields to numerics / dates where required

# find elements of the dataframe where the car make is audi and year is pre 2005
# for all of these elements reduce them by 10 %
# find rows where the numeric fields are Nan
# drop these rows

#deduce region names from region number and map - and put these in dataframe

# group dataframe on region and make
# aggregate using functions of your choice

# do any rounding or changes to column names required

# define an output path based on source path
# output the summary to csv 

# group non aggregated dataframe by car make and model
# aggregate by count
# sort lowest count to highest
# find the lowest count of cars
# find all the items which have this count

In [65]:
# Your code goes here - here are some starting points

import os
import pandas as pd
import numpy as np

# mapping of numbers to regions
region_dict = dict(zip([1,2,3,4,5,6],['North','South-East','South-West','London','Midlands','Other']))

# directory path to read from
source_path = r'C:\Users\jasonboyle\Desktop\Python Training\Car Sales'

# initialise a dictionary to store the files
read_dict = {}

# loop over directories, subdirectories, files as a starting point
for dirs, subdirs, files in os.walk(source_path):
    # loop over list of files
    for file in files:
        # read in the files!
        print('The rest is up to you!')

The rest is up to you!
The rest is up to you!
The rest is up to you!
The rest is up to you!
The rest is up to you!
The rest is up to you!

<b>Answer pt. 1</b> - read in the data

In [66]:
# imports
import os
import pandas as pd
import numpy as np

# mapping of numbers to regions
region_dict = dict(zip([1,2,3,4,5,6],['North','South-East','South-West','London','Midlands','Other']))

# directory path to read from
source_path = r'C:\Users\jasonboyle\Desktop\Python Training\Car Sales'

# initialise a dictionary to store the files
read_dict = {}

# use os.walk to navigate directory
for dirs, subdirs, files in os.walk(source_path):
    # for each iteration files is a list of files in that directory
    #loop over each file
    #print(dirs)
    #print(files)
    for file in files:
        # we can join the directory to the filname to get the full path
        filepath = os.path.join(dirs,file)
        # read in the data
        read_df = pd.read_csv(filepath)
        # get the name of the file without extension
        filename = os.path.splitext(file)[0]
        # store the dataframe in the dictionary using the filename as the key
        read_dict[filename] = read_df
        
        #or in one line:              
        # read_dict[os.path.splitext(file)[0]] = pd.read_csv(os.path.join(dirs,file))

#os.walk(source_path)
#help(os.walk)

read_dict

{'region_1_car_sales':       car_make      car_model  model_year            car_vin   purchase_date  \
 0         Ford       Freestar        2003  WAUKH98E58A381109   on 6/16/2018,
 1        Mazda            626        2002  3C3CFFAR4CT883916   on 4/27/2018,
 2       Subaru           Baja        2003  1GYFC26209R153521  on 11/27/2017,
 3         Ford          Focus        2009  WAULC58E95A491863   on 1/24/2020,
 4      Mercury  Grand Marquis        1995  WAUKG94F56N224154    on 3/2/2020,
 ...        ...            ...         ...                ...             ...
 1995       Ram           3500        2011  1G4GA5GR4CF318407   on 6/16/2019,
 1996     Volvo            S80        2010  1GYEC63T32R130661    on 6/5/2020,
 1997       Kia         Sephia        1995  SAJWA4FB4DL985982   on 11/6/2017,
 1998  Maserati            430        1989  WP1AA2A20EL568618   on 6/14/2019,
 1999   Pontiac       Grand Am        2004  WAUDF48H37K839640   on 5/20/2019,

           title           full_name      dealer        rrp  \
 0            Dr      Cathryn Aloigi     Tagchat  £37484.85
 1            Ms          Keen Sives   Flipstorm  £19138.46
 2           Mrs         Tiffy Baugh       Eabox  £24296.23
 3     Honorable  Fredrick Greenroad      Skidoo  £18775.51
 4     Honorable   Muffin Darlington     Trilith        NaN
 ...         ...                 ...         ...        ...
 1995  Honorable      Stacy Wimpeney  Topicstorm  £20945.06
 1996         Dr      Vasili Clother   Topicware  £13080.99
 1997         Dr    Emmeline Giraudy       Quatz        NaN
 1998  Honorable     Wandie Jozwicki       InnoZ  £33483.17
 1999         Mr     Ainslee Smythin       Rooxo  £18859.98

                        monthly_cost
 0      £540.2542348581231 per month
 1     £279.55088901296773 per month
 2      £386.1739856281775 per month
 3      £307.5218717033825 per month
 4                               NaN
 ...                             ...
 1995  £292.70468219359316 per month
 1996  £218.88687465510074 per month
 1997                            NaN
 1998   £459.8702251248783 per month
 1999  £270.67967099990176 per month

 [2000 rows x 10 columns],
 'region_2_car_sales':        car_make     car_model  model_year            car_vin   purchase_date  \
 0          Ford      Taurus X        2008  WBAYB6C57FG468800  on 11/27/2017,
 1           BMW            X5        2005  JH4CL95848C358850   on 7/16/2019,
 2       Porsche        Cayman        2011  JN8AE2KP9B9442645    on 8/8/2020,
 3        Nissan    Pathfinder        2005  3C63DPGL8CG633072  on 12/14/2019,
 4     Chevrolet  G-Series G20        1993  WDDEJ7GB6BA970196   on 12/6/2017,
 ...         ...           ...         ...                ...             ...
 1995    Hyundai       Elantra        1993  WBA3C1C53DF590213   on 6/17/2018,
 1996   Maserati   GranTurismo        2010  JN1CV6EK2FM266670    on 6/1/2020,
 1997     Toyota        Solara        2000  WBA1M1C50FV678486  on 11/27/2019,
 1998      Honda          CR-V        2001  19UUB2F53FA282004   on 1/18/2019,
 1999      Dodge       Caravan        2009  1FTSX2B5XAE420312    on 5/6/2019,

           title          full_name      dealer        rrp  \
 0           Rev     Lydie Slidders      Voonte  £34851.22
 1            Mr       Jenna Dugood        Tazz  £31801.07
 2            Ms    Glad Waplington    Gigazoom   £56429.7
 3            Ms       Teodoro Cain      Meeveo  £17541.31
 4           Rev  Carmen Claricoats       Jatri  £16772.88
 ...         ...                ...         ...        ...
 1995         Mr       Kerwin Orgen      Rhybox        NaN
 1996        Rev   Rossie Bonniface       Leexo  £30110.66
 1997         Ms    Hyacinthe Saggs  Photospace  £22068.12
 1998         Ms     Sande McKimmey     Buzzdog        NaN
 1999  Honorable       Lucien Denis      Divape  £32628.67

                        monthly_cost
 0      £532.8393354707316 per month
 1     £476.71586299630735 per month
 2      £802.4599373028587 per month
 3     £281.37847003137057 per month
 4      £279.6687179709387 per month
 ...                             ...
 1995                            NaN
 1996   £466.1838030514247 per month
 1997   £329.1410953725737 per month
 1998                            NaN
 1999  £449.26070497345177 per month

 [2000 rows x 10 columns],
 'region_5_car_sales':            car_make    car_model  model_year            car_vin  \
 0         Chevrolet      Equinox        2010  WAUJC58E02A041683
 1        Mitsubishi       Pajero        1987  WP0AA2A89BU167146
 2           Pontiac        Aztek        2002  KNDJT2A52D7420907
 3          Infiniti           QX        1999  SALSF2D40DA844337
 4         Chevrolet  Monte Carlo        2004  WVGAK7A97AD469158
 ...             ...          ...         ...                ...
 1995      Chevrolet       Camaro        2010  JTEBC3EH6D2308697
 1996            Geo      Tracker        1996  1FTSX2B57AE118637
 1997        Pontiac      Firefly        1985  JTDJTUD32ED157357
 1998  Mercedes-Benz         W201        1984  1G6DL5EG8A0813487
 1999      Chevrolet     Colorado        2006  WAUWMAFC6EN201317

        purchase_date      title          full_name        dealer        rrp  \
 0       on 2/5/2017,        Rev       Cori Cleever         Janyx  £19157.73
 1       on 7/5/2020,         Ms    Audrye Leinster        Wikizz  £53535.41
 2     on 12/10/2017,        Rev      Danie Eefting        Eimbee  £21201.71
 3     on 12/24/2018,         Dr      Jessie Hodgon       Edgeify  £28607.79
 4      on 9/17/2018,         Ms       Kerwin Karsh      Jaxworks  £12233.81
 ...              ...        ...                ...           ...        ...
 1995    on 4/8/2020,         Mr  Ardine Mottershaw         Mynte  £13551.62
 1996   on 7/28/2020,  Honorable      Bree Shoreman   Twitterlist        NaN
 1997   on 7/13/2017,         Mr  Leticia Rillstone         Rooxo   £16642.0
 1998   on 3/30/2019,        Mrs     Beverlee Hover       Dabfeed    £576.45
 1999   on 5/20/2020,         Mr     Odette Youhill  Twitterworks  £11181.16

                        monthly_cost
 0     £282.74921901505064 per month
 1      £787.6556185987355 per month
 2     £332.54850252741267 per month
 3     £432.03722536692976 per month
 4     £189.04771882202667 per month
 ...                             ...
 1995  £216.57835135627238 per month
 1996                            NaN
 1997  £244.51019013568646 per month
 1998   £8.537106565021661 per month
 1999   £161.8509914685103 per month

 [2000 rows x 10 columns],
 'region_6_car_sales':         car_make          car_model  model_year            car_vin  \
 0         Toyota       Land Cruiser        2002  1G6DK67V480905355
 1           Ford             Fiesta        2001  1G4HD57267U545078
 2          Lexus          RX Hybrid        2007  WP1AA2A27BL467989
 3        Lincoln           Town Car        1993  KNADM5A36D6414900
 4     Volkswagen              Jetta        1993  WA1WMBFE7CD699566
 ...          ...                ...         ...                ...
 1995         GMC  Sonoma Club Coupe        1997  WDCGG5GB8AF352329
 1996     Mercury             Cougar        1995  5N1AN0NW0EN447999
 1997  Land Rover          Discovery        2012  WBANE73507B154209
 1998       Buick         Roadmaster        1996  1FTSX2B59AE703462
 1999        Audi            Allroad        2004  JN8AZ1MU6DW647376

        purchase_date      title           full_name        dealer        rrp  \
 0      on 5/28/2017,         Mr     Kissiah Marwick        Voolia  £35990.08
 1       on 7/1/2019,  Honorable  Louisette Hanniger        Voonix  £28451.59
 2     on 12/28/2018,        Rev       Orella McLise  Jabbersphere  £34373.27
 3     on 12/14/2018,        Mrs    Dominique Lescop      Devpulse  £23537.74
 4      on 4/13/2020,         Dr        Earle Lloyds       Yakidoo   £59768.0
 ...              ...        ...                 ...           ...        ...
 1995   on 7/15/2017,         Mr      Sherye Swalwel        Tagpad  £42738.09
 1996    on 5/2/2019,        Mrs      Tuckie Chestle        Demizz   £18175.0
 1997   on 2/16/2020,        Mrs        Galen Coling        Skinix  £51702.15
 1998  on 11/17/2019,         Ms   Dorita O'Doireidh      Photobug  £35803.92
 1999   on 2/18/2018,         Mr         Karee Allen       Voolith  £14324.69

                        monthly_cost
 0       £586.675016356132 per month
 1     £428.29660653379057 per month
 2      £535.4903487666945 per month
 3     £376.45216516326485 per month
 4      £904.3204206790776 per month
 ...                             ...
 1995     £664.57565207888 per month
 1996   £278.6208622422934 per month
 1997   £853.4734500528348 per month
 1998   £553.4854146704906 per month
 1999  £210.37309793651974 per month

 [2000 rows x 10 columns],
 'region_3_car_sales':            car_make     car_model  model_year            car_vin  \
 0            Nissan        Xterra        2003  5NPDH4AE1DH160831
 1              Ford          F150        1996  1G4GJ5E3XCF338014
 2             Dodge       Caliber        2012  2FMGK5CC2AB310591
 3           Pontiac    Grand Prix        2005  SAJWA4EC8CM983994
 4     Mercedes-Benz       E-Class        1998  4USBT53564L724584
 ...             ...           ...         ...                ...
 1995     Volkswagen          Golf        1986  5GAER13D59J322979
 1996         Toyota  Land Cruiser        2011  5UXZV4C52DL622674
 1997            BMW            Z4        2011  WAUDF98E48A972613
 1998          Dodge          Neon        1998  1FTEW1CW5AK568628
 1999           Ford        Bronco        1995  WBAKB4C51CC006746

        purchase_date      title           full_name        dealer        rrp  \
 0      on 5/14/2020,         Mr        Jesus Nowick    Zoomlounge    £391.53
 1       on 2/7/2019,        Mrs       Vinni Gambell   Topiclounge  £29818.37
 2       on 5/1/2017,        Rev       Jolee Dedrick  Jabbersphere   £15940.7
 3      on 7/12/2019,         Mr          Kinny Eyre       Tagtune  £25967.65
 4      on 4/13/2017,         Ms       Kathe Tolfrey   Shufflester  £52038.42
 ...              ...        ...                 ...           ...        ...
 1995   on 7/15/2020,  Honorable     Sher Olerenshaw       Jetwire        NaN
 1996    on 9/4/2019,        Rev        Isador Phinn          Ntag  £41903.24
 1997   on 8/15/2020,  Honorable       Bari Senecaut        Voonyx   £51260.3
 1998  on 11/11/2019,        Rev        Munroe Faley       Tagtune  £17063.77
 1999    on 9/5/2020,         Ms  Mattheus Abendroth      Cogilith  £16161.81

                        monthly_cost
 0     £6.4747119412061025 per month
 1      £477.3533840675457 per month
 2     £226.66664115894605 per month
 3     £374.31194436084365 per month
 4      £822.5497042770163 per month
 ...                             ...
 1995                            NaN
 1996   £624.2393989846856 per month
 1997   £708.0484604285655 per month
 1998  £284.57519615393375 per month
 1999  £231.40047286193686 per month

 [2000 rows x 10 columns],
 'region_4_car_sales':        car_make     car_model  model_year            car_vin  purchase_date  \
 0         Honda       Insight        2000  WA1LKBFP6AA772015  on 9/20/2017,
 1       Pontiac    Grand Prix        1969  WBALM7C59DE423571  on 2/23/2017,
 2     Chevrolet  Sportvan G30        1994  WAUXL68E84A546129  on 4/22/2017,
 3           GMC   Savana 2500        2007  WAUMGBFL4CA084958  on 6/15/2018,
 4       Pontiac    Grand Prix        1969  JH4DC54823S101537  on 5/15/2017,
 ...         ...           ...         ...                ...            ...
 1995       Ford        Taurus        1989  1G4HC5EM6BU985821   on 2/1/2020,
 1996  Chevrolet      Corvette        1955  SAJWA4DB9EL727638  on 5/28/2017,
 1997      Volvo           V40        2000  1ZVBP8JZ9E5788901  on 8/17/2018,
 1998      Lexus            RX        2000  WAUNG74F79N231869   on 7/1/2017,
 1999      Mazda      Millenia        1997  WBA6B8C50FD883526   on 6/2/2018,

           title          full_name        dealer        rrp  \
 0           Rev  Angelina Killoran      Riffpath  £29711.11
 1            Mr       Sybil Losbie    Brainverse   £30145.4
 2            Mr      Elsie Garrett  Thoughtworks  £18043.38
 3           Mrs        Byram Perel         Mynte  £45493.78
 4            Ms     Lanna Hawkshaw      Tanoodle  £30530.53
 ...         ...                ...           ...        ...
 1995        Rev   Anthia Van Hault         Voomm  £36273.03
 1996        Mrs    Kerwin Sperling      Cogilith  £25598.22
 1997  Honorable      Georas Tapson        Roombo   £4319.34
 1998        Rev   Lezlie Whitworth       Tagopia  £41179.96
 1999        Rev        Juli Keming         Jamia  £10225.94

                        monthly_cost
 0      £434.9866977585823 per month
 1      £415.3120379530529 per month
 2      £292.5017389386592 per month
 3      £735.0908196600423 per month
 4     £496.42162506623663 per month
 ...                             ...
 1995   £547.9439627361237 per month
 1996   £421.1100015481617 per month
 1997   £59.67899060629221 per month
 1998   £609.2465574660928 per month
 1999  £165.84722036327264 per month

 [2000 rows x 10 columns]}

<b>Answer pt. 2</b> - deduce the region numbers

In [67]:
# iterate over the key, value pairs in the dictionary
for filename, df in read_dict.items():
    #split the filename on '_'
    split_list = filename.split('_')
    # 2nd element (index 1) is the region number
    region_num = split_list[1]
    # let's convert to int instead of str - since this matches the region dict
    region_num = int(region_num)
    # add the region number to all rows in this dataframe
    df['region'] = region_num
    
    # or in one line
    #df['region'] = int(filename.split('_')[1])
# show the results    
for key in read_dict:
   print(read_dict[key]['region'][0])

1
2
5
6
3
4

<b>Answer pt.3</b> - concatenate the DataFrames and fix the formats

In [68]:
# join the dataframes into one dataframe
full_df = pd.concat(read_dict).reset_index(drop = True)


# do some integrity checks
import missingno as mn
#mn.matrix(full_df)
full_df.info()
full_df.describe()

# mn.matrix(full_df[full_df['region'] == 1])

full_df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   car_make       12000 non-null  object
 1   car_model      12000 non-null  object
 2   model_year     12000 non-null  int64
 3   car_vin        12000 non-null  object
 4   purchase_date  12000 non-null  object
 5   title          12000 non-null  object
 6   full_name      12000 non-null  object
 7   dealer         12000 non-null  object
 8   rrp            11510 non-null  object
 9   monthly_cost   11510 non-null  object
 10  region         12000 non-null  int64
dtypes: int64(2), object(9)
memory usage: 1.0+ MB

,car_make,car_model,model_year,car_vin,purchase_date,title,full_name,dealer,rrp,monthly_cost,region
0,Ford,Freestar,2003,WAUKH98E58A381109,"on 6/16/2018,",Dr,Cathryn Aloigi,Tagchat,£37484.85,£540.2542348581231 per month,1
1,Mazda,626,2002,3C3CFFAR4CT883916,"on 4/27/2018,",Ms,Keen Sives,Flipstorm,£19138.46,£279.55088901296773 per month,1
2,Subaru,Baja,2003,1GYFC26209R153521,"on 11/27/2017,",Mrs,Tiffy Baugh,Eabox,£24296.23,£386.1739856281775 per month,1
3,Ford,Focus,2009,WAULC58E95A491863,"on 1/24/2020,",Honorable,Fredrick Greenroad,Skidoo,£18775.51,£307.5218717033825 per month,1
4,Mercury,Grand Marquis,1995,WAUKG94F56N224154,"on 3/2/2020,",Honorable,Muffin Darlington,Trilith,NaN,NaN,1
...,...,...,...,...,...,...,...,...,...,...,...
11995,Ford,Taurus,1989,1G4HC5EM6BU985821,"on 2/1/2020,",Rev,Anthia Van Hault,Voomm,£36273.03,£547.9439627361237 per month,4
11996,Chevrolet,Corvette,1955,SAJWA4DB9EL727638,"on 5/28/2017,",Mrs,Kerwin Sperling,Cogilith,£25598.22,£421.1100015481617 per month,4
11997,Volvo,V40,2000,1ZVBP8JZ9E5788901,"on 8/17/2018,",Honorable,Georas Tapson,Roombo,£4319.34,£59.67899060629221 per month,4
11998,Lexus,RX,2000,WAUNG74F79N231869,"on 7/1/2017,",Rev,Lezlie Whitworth,Tagopia,£41179.96,£609.2465574660928 per month,4
11999,Mazda,Millenia,1997,WBA6B8C50FD883526,"on 6/2/2018,",Rev,Juli Keming,Jamia,£10225.94,£165.84722036327264 per month,4

In [69]:
# convert the purchase date using the built in pandas function - no need to remove the strings around it
full_df['purchase_date'] = pd.to_datetime(full_df['purchase_date'])

# remove the £ signs for rrp
full_df['rrp'] = full_df['rrp'].str.replace('£','')
# convert to numeric
full_df['rrp'] = pd.to_numeric(full_df['rrp'])
# round to 2dp
full_df['rrp'] = np.round(full_df['rrp'],2)

#or in one line
# full_df['rrp'] = np.round(pd.to_numeric(full_df['rrp'].str.replace('£','')),2)

# remove the £ signs for monthly_cost
# could use regex here for more generic cases
full_df['monthly_cost'] = full_df['monthly_cost'].str.replace('£','')
# remove the ' per month' string
full_df['monthly_cost'] = full_df['monthly_cost'].str.replace(' per month','')
# convert to numeric
full_df['monthly_cost'] = pd.to_numeric(full_df['monthly_cost'])
# round to 2dp
full_df['monthly_cost'] = np.round(full_df['monthly_cost'],2)

# or in one line
# full_df['monthly_cost'] = np.round(pd.to_numeric(full_df['monthly_cost'].str.replace('£','').str.replace(' per month','')),2)

full_df


# more integrity checks
full_df.info()
full_df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   car_make       12000 non-null  object
 1   car_model      12000 non-null  object
 2   model_year     12000 non-null  int64
 3   car_vin        12000 non-null  object
 4   purchase_date  12000 non-null  datetime64[ns]
 5   title          12000 non-null  object
 6   full_name      12000 non-null  object
 7   dealer         12000 non-null  object
 8   rrp            11510 non-null  float64
 9   monthly_cost   11510 non-null  float64
 10  region         12000 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(2), object(6)
memory usage: 1.0+ MB

         model_year            rrp  monthly_cost        region
count  12000.000000   11510.000000  11510.000000  12000.000000
mean    2000.237917   30903.613569    471.379674      3.500000
std        9.123673   18110.330517    277.889023      1.707896
min     1909.000000      12.040000      0.190000      1.000000
25%     1994.000000   16860.250000    255.925000      2.000000
50%     2002.000000   29760.145000    452.455000      3.500000
75%     2007.000000   43097.575000    656.625000      5.000000
max     2013.000000  118678.550000   1706.720000      6.000000

<b>Answer pt. 4</b> - Audi writedown, remove missing fields, and map regions

In [ ]:
# writedown audi values
# use a list of the relevant columns to avoid repeating code
for col in ['rrp','monthly_cost']:
    1==1
    # for each of the 2 columns test whether make is Audi and year < 2005 using np.where and bitwise & operator
    full_df[col] = np.where((full_df.loc[:,'car_make'] == 'Audi') & (full_df.loc[:,'model_year'] < 2005)
                            ,full_df.loc[:,col]*0.7,full_df.loc[:,col])
    # if true then x 0.7 if false, leave as is

# find indeces where both numeric fields are NaN using bitwise & for logical test    
bad_indeces = full_df[(full_df['rrp'].isna()== True) & (full_df['monthly_cost'].isna() == True)].index

# drop these rows
full_df = full_df.drop(bad_indeces, axis = 0)

# use map to map numbers to regions from the region_dict
full_df['region'] = full_df.loc[:,'region'].map(region_dict)

full_df

<b>Answer pt.5</b> - Summarise regions

In [ ]:
# group on region and make
grouped_df = full_df.groupby(['region', 'car_make'])
# aggregate using functions of your choice
agg_df = grouped_df.agg({'car_vin':'count','rrp': ['mean','sum'], 'monthly_cost': ['mean']})

# create list of flattened columns for ease
new_cols = [col+'_'+function for col, function in agg_df.columns.ravel()]
# assign new columns
agg_df.columns = new_cols

#lets round all decimal columns to 2dp
# get a list of columns we want to round
decimal_cols = agg_df.columns[1:4]
# round using numpy round
agg_df = np.round(agg_df[decimal_cols],2)

# define an output path based on source path
out_path = os.path.join(source_path,'car_sales_summary.csv')
# output the summary to csv - let's do pipe dimited, and include the index:
agg_df.to_csv(out_path, index = True, sep = '|')

agg_df

<b>Answer pt.6</b> - Find the rarest cars

In [ ]:
# find the rarest cars
rare_df = full_df.groupby(['car_make','car_model']).agg({'car_vin' : 'count'})

# assign new column names
rare_df.columns = ['car_count']

# sort rarest to least rare
rare_df = rare_df.sort_values(by = 'car_count', ascending = True)#

rare_df

In [ ]:
# find the lowest count (i.e. the rarest cars have this count)
min_count = min(rare_df['car_count'])
# return only these cars
rare_df[rare_df['car_count'] == min_count]

## Appendix - Strings and escape chars<a id = '19'></a>
[Back to contents](#cont)

Funnies and escape characters:

In [ ]:
a = 'isn't'

Using <code>''</code> doesn't work - quotes are different to normal eschape chars

In [ ]:
a = 'isn''t'
a

Can swap quote types

In [ ]:
a = "isn't"
a

Or can escape with backslash <code>\\</code>

In [ ]:
a = 'isn\'t'
a

What if the string contains <code>\\</code>?

Different problem - interpreter thinks <code>\U</code> is a unicode string

In [ ]:
path = 'C:\Users\jasonboyle\Desktop\Python Training'

Can escape your slashes!

In [ ]:
path = 'C:\\Users\jasonboyle\\Desktop\\Python Training'
path

Or use a 'raw' string

In [ ]:
path = r'C:\Users\jasonboyle\Desktop\Python Training'
path